# St7SetEntityResult

Sets the enabled state for the specified entity result. Only enabled entity results are written to the result file.

long St7SetEntityResult(long uID, long Result, bool Enabled)
Input Parameters
uID
Strand7 model file ID.
Result
See Solver Options for additional information.
Enabled
Either True or False.